# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 + DySample + iEMA for object detection with P3-P5 outputs

# Parameters
nc: 80  # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone with iEMA
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]        # 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]       # 8
  - [-1, 1, iRMB_EMA, []]            # 9
  - [-1, 1, SPPF, [1024, 5]]         # 10

# YOLOv8.0n head with DySample and iEMA-enhanced C2f
head:
  - [-1, 1, Dy_Sample, []]           # 11
  - [[-1, 6], 1, Concat, [1]]        # 12 cat backbone P4
  - [-1, 3, C2f, [512]]              # 13

  - [-1, 1, Dy_Sample, []]           # 14
  - [[-1, 4], 1, Concat, [1]]        # 15 cat backbone P3
  - [-1, 3, C2f_iRMB_EMA, [256]]     # 16 P3/8-small

  - [-1, 1, Conv, [256, 3, 2]]       # 17
  - [[-1, 13], 1, Concat, [1]]       # 18 cat head P4, corrected from 12 to 13
  - [-1, 3, C2f_iRMB_EMA, [512]]     # 19 P4/16-medium

  - [-1, 1, Conv, [512, 3, 2]]       # 20
  - [[-1, 10], 1, Concat, [1]]       # 21 cat head P5, corrected from 9 to 10
  - [-1, 3, C2f, [1024]]             # 22 P5/32-large

  - [[16, 19, 22], 1, Detect, [nc]]  # 23 Detect(P3, P4, P5)